Repository: ViterOK-93/PyroCraft
Catalog: image-to-gcode/I2GResources.*.resx
Languages: es, hu, ru

# PF_Initializing
source: Initializing...
es: Inicializando...
hu: Inicializálás...
ru: Инициализация...

# PF_GeneratingGCode
source: Generating G-code...
es: Generando código G...
hu: G-kód gelerálás...
ru: Генерация G-кода...

# PF_Run
source: &RUN
es: EMPEZAR
hu: INDÍT

# PF_Pause
source: &PAUSE
es: PAUSA
hu: SZÜNET

# PF_Abort
source: &ABORT
es: ABORTAR
hu: MEGSZAKÍT
ru: СТОП

# PF_SendingFile
source: Sending NC-file...
es: Enviando archivo NC...
hu: NC-file küldés...
ru: Отправка NC-файла...

# PF_SendingData
source: Sending data...
es: Enviando datos...
hu: Adat küldés...
ru: Отправка данных...

# Grbl_InvalidResponse
source: Invalid response from Controller!
es: Respuesta no válida del controlador!
hu: Érvénytelen válasz a vezérlőtől!
ru: Некорректный ответ от контроллера!

# Grbl_NotResponding
source: Controller is not responding!
es: El controlador no responde!
hu: A vezérlő nem válaszol!
ru: Контроллер не отвечает!

# Menu_File
source: &File
es: Archivo
hu: Fájl
ru: Файл

# Menu_Open
source: &Open...
es: Abrir...
hu: Megnyit...
ru: Открыть...

# Menu_Reload
source: &Reload
es: Recargar
hu: Újratölt
ru: Перечитать

# Menu_SaveGCode
source: &Save G-code...
es: Salvar código G...
hu: G-kód mentése...
ru: Сохранить G-код...

# Menu_Close
source: &Close
es: Cerrar
hu: Bezár
ru: Закрыть

# Menu_Language
source: &Language
es: Idioma
hu: Nyelv
ru: Язык

# Menu_Exit
source: E&xit
es: Salir
hu: Kilép
ru: Выход

# Menu_Image
source: I&mage
es: Imagen
hu: Kép
ru: Изображение

# Menu_SaveImage
source: S&ave a copy as...
es: Guardar una copia como...
hu: Másolat mentése mint...
ru: Сохранить копию как...

# Menu_CropBorder
source: &Crop border
es: Cortar borde
hu: Határvágás
ru: Обрезать фон

# Menu_Preset
source: P&reset
es: Preestablecido
hu: Előbeállítás
ru: Пресет

# Menu_PresetLoad
source: &Load Preset from
es: Cargar preajuste desde
hu: Előbeállítás betöltése innen
ru: Загрузить пресет из

# Menu_PresetSave
source: &Save Preset to
es: Guardar preajuste en
hu: Előbeállítás mentése ide
ru: Сохранить пресет в

# Menu_PresetFile
source: &File...
es: Archivo...
hu: Fájl...
ru: Файл...

# Menu_MachineType
source: &Machine Type ({0})
es: Tipo de máquina ({0})
hu: Gép típus ({0})
ru: Тип станка ({0})

# Menu_MachineOrigin
source: Machine &Origin ({0})
es: Origen de la Máquina ({0})
hu: Kezdő koordináták ({0})

# Menu_Machine
source: Mac&hine
es: Máquina
hu: Gép
ru: Станок

# Menu_SerialPort
source: Serial &Port ({0})
es: Puerto serie ({0})
hu: Soros Port ({0})
ru: COM-порт ({0})

# Menu_BaudRate
source: &Baud Rate ({0})
es: Tasa de transferencia ({0})
hu: Sebesség ({0})

# Menu_Send
source: S&end...
es: Enviar...
hu: Küld...
ru: Отправить...

# Menu_SendFile
source: Send NC-&file...
es: Enviar archivo-NC...
hu: NC-fájl küldés...
ru: Отправить NC-файл...

# Menu_Configuration
source: &Configuration...
es: Configuración...
hu: Konfiguráció...
ru: Конфигурация...

# Menu_Help
source: H&elp
es: Ayuda
hu: Segítség
ru: Помощь

# Menu_Website
source: Image2GCode Web&site
es: Sitio web de Image2GCode
hu: Image2GCode Weboldal
ru: Страница на GitHub

# Menu_Donate
source: &Donate
es: Donar
hu: Adományoz

# Menu_About
source: &About...
es: Acerca...
hu: Infó...
ru: О программе...

# Btn_Open
source: Open...
es: Abrir...
hu: Nyit...
ru: Открыть...

# Btn_SaveGCode
source: Save G-code...
es: Salvar Código G...
hu: G-kód mentés...
ru: Сохранить G-код...

# Btn_Send
source: Send...
es: Enviar...
hu: Küld...
ru: Отправить...

# Status_Ready
source: Ready
es: Listo
hu: Kész
ru: Готово

# Status_Zoom
source: Zoom: {0}%
hu: Nagyítás: {0}%
ru: Масштаб: {0}%

# Status_ImageSize
source: Image size: {0} x {1}
es: Tamaño de imagen: {0} x {1}
hu: Kép méret: {0} x {1}
ru: Размер картинки: {0} x {1}

# Status_BurningArea
source: Burning area: {0:0.#} cm^2
es: Área de quemado: {0:0.#} cm^2
hu: Egetés felület: {0:0.#} cm^2
ru: Площадь выжигания: {0:0.#} см^2

# Status_YStepover
source: Y stepover: {0:0.0##} mm
es: Paso Y: {0:0.0##} mm
hu: Y lépésköz: {0:0.0##} mm
ru: Шаг по Y: {0:0.0##} мм

# Status_ApproxRunTimeUnknown
source: Approx run time: unknown
es: Tiempo de ejecución aproximado: desconocido
hu: Futási idő: ismeretlen
ru: Время выполнения: неизвестно

# Status_ApproxRunTimeSeconds
source: Approx run time: ~{0}s
es: Tiempo de ejecución aproximado: ~{0}s
hu: Futási idő: ~{0}s
ru: Время выполнения: ~{0}с

# Status_ApproxRunTimeMinutes
source: Approx run time: ~{0}m
es: Tiempo de ejecución aproximado: ~{0}m
hu: Futási idő: ~{0}m
ru: Время выполнения: ~{0}м

# Status_ApproxRunTimeHours
source: Approx run time: ~{0}h
es: Tiempo de ejecución aproximado: ~{0}h
hu: Futási idő: ~{0}h
ru: Время выполнения: ~{0}ч

# Status_ApproxRunTime
source: Approx run time: ~{0}h {1}m
es: Tiempo de ejecución aproximado: ~{0}h {1}m
hu: Futási idő: ~{0}h {1}m
ru: Время выполнения: ~{0}ч {1}м

# Im_1BitPalette
source: Use &1-bit palette
es: Usar paleta de 1-bit
hu: Egy bites paletta
ru: Черно-белая палитра

# Im_Dithering
source: &Dithering:
es: Tramado:
hu: Zajmoduláció:
ru: Дизеринг:

# Im_BlackThreshold
source: Black threshold:
es: Umbral negro:
hu: Fekete küszöb:
ru: Порог черного:

# Im_InvertColors
source: &Invert colors
es: Invertir colores
hu: Színfordítás
ru: Инвертировать цвета

# Im_SharpenForce
source: Sharpen Force:
es: Forzar Afilado:
hu: Élesítés erősség:
ru: Усиление резкости:

# Im_Brightness
source: Brightness:
es: Brillo:
hu: Fényerő:
ru: Яркость:

# Im_Contrast
source: Contrast:
es: Contraste:
hu: Kontraszt:
ru: Контраст:

# Im_Resolution
source: Image resolution (&DPI):
es: Resolucion de imagen (DPI):
hu: Kép felbontás (DPI):
ru: Разрешение картинки (DPI):

# Im_SameAsX
source: S&ame as X
es: Igual que X
hu: Ugyanaz mint X
ru: Как по X

# Im_RotateFlip
source: Rotate/Flip Image:
es: Girar/Voltear imagen:
hu: Kép elforgatása/megfordítása:

# Im_Width
source: &Width:
es: Ancho:
hu: Szélesség:
ru: Ширина:

# Im_Height
source: Hei&ght:
es: Altura:
hu: Magasság:
ru: Высота:

# Im_Interpolation
source: Inter&polation:
es: Interpolación:
hu: Interpoláció:
ru: Интерполяция:

# Im_AspectRatio
source: Aspect ratio:
es: Relación de aspecto:
hu: Képarány:

# Im_KeepAspectRatio
source: &Keep aspect ratio
es: Mantener la relación de aspecto
hu: Képarány megtartás

# Gc_Speed
source: Spee&d:
es: Velocidad:
hu: Sebesség:
ru: Скорость:

# Gc_Power
source: &Power:
es: Poder:
hu: Erősség:
ru: Мощность:

# Gc_Accel
source: A&ccel:
es: Aceleración:
hu: Gyorsulás:

# Menu_G0Spd
source: Rapid Spee&d ({0:0.#})
es: Velocidad rápida ({0:0.#})
hu: Gyors sebesség ({0:0.#})
ru: Скорость холостого хода ({0:0.#})

# Gc_Shift
source: Shif&t:
es: Cambio:
hu: Váltás:

# Gc_HeatDelay
source: Heat &Delay:
es: Retraso de calor:
hu: Melegítés késleltetés:
ru: Задержка на нагрев:

# Gc_AirAssist
source: Air Assist
es: Asistencia de aire
hu: Levegő segítség
ru: Помощь воздухом

# Gc_ChangeSpeedOnWhite
source: Cha&nge speed on white
es: Cambiar velocidad en blanco
hu: Sebesség váltás fehéren
ru: Менять скорость на белом

# Gc_WhiteSpeed
source: &White Speed:
es: Velocidad en blanco:
hu: Fehér sebesség:
ru: Скорость на белом:

# Gc_WhiteDistance
source: Min &Distance:
es: Distancia mínima:
hu: Min Távolság:
ru: Мин. растояние:

# Gc_Bidirectional
source: &Bidirectional
es: Bidireccional
hu: Kétirányú
ru: В обе стороны

# Gc_BurnToTheCleaningStrip
source: B&urn to the Cleaning Strip
es: Quemar hasta la tira de limpieza
hu: Tisztítósávon égetés

# Gc_CleaningStrategy
source: Cleaning Strate&gy:
es: Estrategia de limpieza:
hu: Tisztító Stratégia:
ru: Очистка жала:

# Gc_StripSide
source: S&trip Position:
es: Posición de la tira:
hu: Sáv Pozició:

# Gc_StripWidth
source: &Width:
es: Ancho:
hu: Szélesség:
ru: Ширина полосы:

# Gc_StripSpeed
source: Sp&d on the Strip:
es: Velocidad en la tira:
hu: Sebesség a sávon:
ru: Скорость на полосе:

# Gc_CleaningField
source: Cleaning Fiel&d:
es: Campo de limpieza:
hu: Tisztító Terület:
ru: Поле очистки:

# Gc_CleaningSpd
source: Cleaning Spee&d:
es: Velocidad de limpieza:
hu: Tisztító Sebesség:
ru: Скорость очистки:

# Gc_CleaningCycles
source: &Cycles:
es: Ciclos:
hu: Ciklusok:
ru: Циклов:

# Gc_NumberOfPasses
source: Number of &Passes:
es: Número de pases:
hu: Menetek száma:
ru: Кол-во проходов:

# Menu_GoToNextLine
source: &Go to Next Line ({0})
es: Ir a la siguiente línea ({0})
hu: Következő sor ({0})

# Menu_ReturnToOrigin
source: Return to O&rigin ({0})
es: Volver al origen ({0})
hu: Kezdőpontra vissza ({0})

# Menu_DoNotReturnY
source: Do not return Y to O&rigin
es: No retornar Y al origen
hu: Y ne térjen vissza kezdőpontra
ru: Не возвращать Y в ноль

# Gc_PrependImageFrame
source: Prepend Image Frame to G-code
es: Marco antes del código G
hu: Tegye fel a keretet a G-kódra

# Gc_FrameSpeed
source: Frame Spee&d:
es: Velocidad del marco:
hu: Keret Sebesség:

# Gc_FramePower
source: Frame &Power:
es: Poder del marco:
hu: Keret Erősség:

# Gc_FrameWorkArea
source: Image work area
es: Área de trabajo de imágenes
hu: Kép munkaterület

# Gc_EditGraph
source: EDIT GRAPH
es: EDITAR GRÁFICO
hu: ÁBRA MÓDOSÍTÁS
ru: РЕДАКТ. ГРАФИК

# DefaultPresetName
source: Standard Preset
es: Preajuste estándar
hu: Standard Előbeállítás

# Gc_CleaningRowsCount
source: Ro&ws count:
es: Recuento de filas:
hu: Sorok száma:
ru: Кол-во строк:

# Gc_CleaningDistance
source: &Distance:
es: Distancia:
hu: Távolság:

# Im_ResultPreview
source: Result Preview:
es: Vista previa de resultados:
hu: Előnézet:

# Im_TextureWrapMode
source: &Wrap Mode:
es: Modo de envoltura:
hu: Burkolás Módja:

# Im_TextureSize
source: Si&ze:
es: Tamaño:
hu: Méret:

# Im_PreviewColor
source: &Color:
hu: Szín:

# Menu_DownloadCH340Driver
source: Do&wnload COM-port driver
es: Descargar controlador de puerto COM
hu: SOROS-port illesztő letöltés
ru: Скачать драйвер COM-порта

# About_Title
source: About
es: Acerca
hu: Infó
ru: О программе

# About_MakeASmallDonation
source: If you found this software useful, make a small donation.
es: Si encuentra útil este software, haga una pequeña donación.
hu: Ha hasznosnak találta ezt a szoftvert, adományozzon.
ru: Если вы нашли эту программу полезной, сделайте небольшое пожертвование.

# Status_LoadingImage
source: Loading image...
es: Cargando imagen...
hu: Kép betöltése...
ru: Загрузка картинки...

# Status_AppIsLoading
source: Application is loading...
es: La aplicación se está cargando...
hu: Az alkalmazás betöltődik...
ru: Программа загружается...

# Status_AppIsClosing
source: Application is closing...
es: La aplicación se está cerrando...
hu: Az alkalmazás bezár...
ru: Программа закрывается...

# Status_ApplyingFilters
source: Applying filters...
es: Aplicando filtros...
hu: Szűrők alkalmazása...
ru: Применение фильтров...

# Status_ApplyingDithering
source: Applying dithering...
es: Aplicando tramado...
hu: Zajmoduláció alkalmazása...
ru: Применение дизеринга...

# Status_PreparingTexture
source: Preparing texture...
es: Preparando textura...
hu: Textúra előkészítése...

# Status_GeneratingPreview
source: Generating preview...
es: Generando vista previa...
hu: Előnézet generálás...

# Status_CalculatingWorkTime
source: Calculating work time...
es: Calculando el tiempo de trabajo...
hu: Munkaidő kiszámítása...
ru: Расчет времени выполнения...

# Status_ResizingImage
source: Resizing image...
es: Cambiando el tamaño de la imagen...
hu: Kép átméretezés...
ru: Изменение размера...

# WO_MmPerRevolutionX
source: MM per R&evolution X:
es: MM por revolución X:
hu: MM forradalomonként X:

# WO_MmPerRevolutionY
source: MM per R&evolution Y:
es: MM por revolución Y:
hu: MM forradalomonként Y:

# WO_CylinderDiameter
source: &Diameter of Cylinder:
es: Diámetro del cilindro:
hu: Henger átmérője:

# WO_AxisBeingWrapped
source: &Axis Being Wrapped:
es: Eje envuelto:
hu: Tengely körbeforgatva:

# WO_label5
source: Image is wrapped {0:0.#} degrees around the cylinder.
es: La imagen se envuelve {0:0.#} grados alrededor del cilindro.
hu: Kép körbeforgatva {0:0.#} fokkal a henger körül.

# Menu_SpeedGraphReset
source: Reset Sp&eed Graph to
es: Restablecer el gráfico de velocidad a
hu: Sebesség grafikon visszaállítás
ru: Вернуть график скорости к

# Menu_PowerGraphReset
source: Reset Po&wer Graph to
es: Restablecer el gráfico de poder a
hu: Sebesség grafikon visszaállítás
ru: Вернуть график мощности к

# Menu_GraphLinear
source: Li&near
es: Lineal
hu: Lineáris
ru: Линейный

# Menu_GraphDefault
source: &Default
es: Defecto
hu: Alapértelmezett
ru: ПАУК

# Menu_SaveGCodeWO
source: Save G-code (&Wrapped Output)...
es: Guardar código G (Salida envuelta)...
hu: G-kód mentés (Körbeforgatott kinemet)...

# Menu_SendWO
source: Send (&Wrapped Output)...
es: Enviar (Salida envuelta)...
hu: Küldés (Körbeforgatott kinemet)...

# WO_Title
source: Wrapped Output
es: Salida envuelta
hu: Körbeforgatott kinemet

# GrblSet_Title
source: Grbl Settings
es: Configuración del controlador
hu: Vezérlő Beállítás
ru: Конфигурация контроллера

# GrblSet_XAxis
source: X Axis
es: Eje X
hu: X Tengely
ru: Ось X

# GrblSet_YAxis
source: Y Axis
es: Eje Y
hu: Y Tengely
ru: Ось Y

# GrblSet_MaxVelocity
source: Max &Velocity:
es: Velocidad máxima:
hu: Max Sebesség:
ru: Макс. скорость:

# GrblSet_MaxAccel
source: A&cceleration:
es: Aceleración:
hu: Gyorsulás:
ru: Макс. ускорение:

# GrblSet_MaxTravel
source: Ta&ble Size:
es: Tamaño de la mesa:
hu: Asztal Méret:
ru: Размер стола:

# GrblSet_FastJog
source: &Fast Jog:
es: Movimiento rápido:
hu: Gyors Lökés:

# GrblSet_SlowJog
source: Slo&w Jog:
es: Movimiento lento:
hu: Lassú Lökés:

# GrblSet_JunctionDeviation
source: &Junction Deviation:
es: Desviación de la unión:
hu: Csomópont eltérés:

# GrblSet_ArcTolerance
source: &Arc Tolerance:
es: Tolerancia al arco:
hu: Ív Tűréshatár:

# GrblSet_InvertStEnablePin
source: Invert Stepper Enable/Disable Pin
es: Invert Stepper EN Pin
hu: Invert Stepper EN Pin

# GrblSet_CoreXY
source: CoreXY/H-bot &Kinematics
hu: CoreXY/H-bot Kinematika
ru: Кинематика CoreXY/H-бот

# GrblSet_LaserMode
source: &Laser Mode
es: Modo láser
hu: Lézer Mód

# GrblSet_FastGrid
source: &Fast Grid:
es: Cuadrícula rápida:
hu: Gyors rácsköz:

# GrblSet_SlowGrid
source: Slo&w Grid:
es: Cuadrícula lenta:
hu: Lassú rácsköz:

# PF_RetrievingGrblSettings
source: Retrieving Grbl Settings...
es: Recuperando la configuración del controlador...
hu: Vezérlő beállítások lekérése...
ru: Получение настроек контроллера...

# Im_Gamma
source: Gamma:
es: Gama:
ru: Гамма:

# Menu_CheckForUpdates
source: Check for &updates
es: Buscar actualizaciones
